tap "hashicorp/tap"

# Core development tools
brew "git"
brew "gnupg"
brew "openssh"
brew "ripgrep"
brew "tree"
brew "wget"
brew "curl"

# Infrastructure as Code
brew "tfenv"
brew "hashicorp/tap/terraform"

# Optional: Visualization
brew "graphviz"

# IDEs
cask "webstorm"

# Productivity Tools
cask "raycast"        # Spotlight replacement with extensions
cask "contexts"       # Window switcher with search
cask "rectangle"      # Window management (tile windows)

# Development
brew "docker"         # Docker CLI
cask "docker-desktop" # Docker Desktop GUI

# Terminal
brew "ghostty"        # Fast, native terminal emulator
