tap "hashicorp/tap"

# Core development tools
brew "git"
brew "gnupg"
brew "openssh"
brew "ripgrep"
brew "tree"
brew "wget"
brew "curl"

# Java development
brew "openjdk"
brew "maven"

# Infrastructure as Code
brew "tfenv"
brew "hashicorp/tap/terraform"

# Optional: Visualization
brew "graphviz"

# IDEs
cask "webstorm"

# VS Code extensions (managed by Brewfile)
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
