eamodio.gitlens
github.copilot-chat
github.vscode-github-actions
hashicorp.terraform
ms-vscode-remote.remote-containers
redhat.java
tamasfe.even-better-toml
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
